podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/CAN0_S32K14x.svd.xml
            <cluster>
               <name>FIFO</name>
               <addressOffset>0x80</addressOffset>
               <register>
                  <name>CS</name>
                  <description>FIFO Message Buffer CS Register</description>
                  <addressOffset>0x0</addressOffset>
                  <fields>
                     <field>
                        <name>TIME_STAMP</name>
                        <description>Free-Running Counter Time stamp. This 16-bit field is a copy of the Free-Running Timer, captured for Tx and Rx frames at the time when the beginning of the Identifier field appears on the CAN bus</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                     <field>
                        <name>DLC</name>
                        <description>Length of the data to be stored/transmitted</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>RTR</name>
                        <description>Remote Transmission Request. One/zero for remote/data frame</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>IDE</name>
                        <description>ID Extended. One/zero for extended/standard format frame</description>
                        <bitOffset>21</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SRR</name>
                        <description>Substitute Remote Request. Contains a fixed recessive bit</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>IDHIT</name>
                        <description>Identifier Acceptance Filter Hit Indicator</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>ID</name>
                  <description>FIFO Message Buffer ID Register</description>
                  <addressOffset>0x4</addressOffset>
                  <fields>
                     <field>
                        <name>EXT</name>
                        <description>Contains extended (LOW word) identifier of message buffer</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>18</bitWidth>
                     </field>
                     <field>
                        <name>STD</name>
                        <description>Contains standard/extended (HIGH word) identifier of message buffer</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>11</bitWidth>
                     </field>
                     <field>
                        <name>PRIO</name>
                        <description>Local priority. This 3-bit field is only used when LPRIO_EN bit is set in MCR and it only makes sense for Tx buffers. These bits are not transmitted. They are appended to the regular ID to define the transmission priority</description>
                        <bitOffset>29</bitOffset>
                        <bitWidth>3</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>WORD0</name>
                  <description>FIFO Message Buffer WORD0 Register</description>
                  <addressOffset>0x8</addressOffset>
                  <fields>
                     <field>
                        <name>DATA_BYTE_3</name>
                        <description>Data byte 3 of Rx/Tx frame</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>DATA_BYTE_2</name>
                        <description>Data byte 2 of Rx/Tx frame</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>DATA_BYTE_1</name>
                        <description>Data byte 1 of Rx/Tx frame</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>DATA_BYTE_0</name>
                        <description>Data byte 0 of Rx/Tx frame</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>WORD1</name>
                  <description>FIFO Message Buffer WORD1 Register</description>
                  <addressOffset>0xC</addressOffset>
                  <fields>
                     <field>
                        <name>DATA_BYTE_7</name>
                        <description>Data byte 7 of Rx/Tx frame</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>DATA_BYTE_6</name>
                        <description>Data byte 6 of Rx/Tx frame</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>DATA_BYTE_5</name>
                        <description>Data byte 5 of Rx/Tx frame</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>DATA_BYTE_4</name>
                        <description>Data byte 4 of Rx/Tx frame</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <dim>$(FILTER_COUNT)</dim>
                  <dimIncrement>4</dimIncrement>
                  <name>FILTER_ID_A</name>
                  <description>FIFO Message Filter ID</description>
                  <addressOffset>0x60</addressOffset>
                  <fields>
                     <field>
                        <name>RXID</name>
                        <description>Rx Frame Identifier</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>29</bitWidth>
                     </field>
                     <field>
                        <name>IDE</name>
                        <description>Extended Frame</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RTR</name>
                        <description>Remote Frame</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <dim>$(FILTER_COUNT)*2</dim>
                  <dimIncrement>2</dimIncrement>
                  <name>FILTER_ID_B</name>
                  <description>FIFO Message Filter ID</description>
                  <addressOffset>0x60</addressOffset>
                  <size>16</size>
                  <fields>
                     <field>
                        <name>RXID</name>
                        <description>Rx Frame Identifier</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>14</bitWidth>
                     </field>
                     <field>
                        <name>IDE</name>
                        <description>Extended Frame</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RTR</name>
                        <description>Remote Frame</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <dim>$(FILTER_COUNT)*4</dim>
                  <dimIncrement>1</dimIncrement>
                  <name>FILTER_ID_C</name>
                  <description>FIFO Message Filter ID</description>
                  <addressOffset>0x60</addressOffset>
                  <size>8</size>
                  <fields>
                     <field>
                        <name>RTR_B</name>
                        <description>Remote Frame</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
            <cluster>
               <dim>$(MESSAGE_BUFFER_COUNT)</dim>
               <dimIncrement>16</dimIncrement>
               <name>MB,@p@f@i</name>
               <addressOffset>0x80</addressOffset>
               <register>
                  <name>CS</name>
                  <description>Message Buffer 0 CS Register</description>
                  <addressOffset>0x0</addressOffset>
                  <fields>
                     <field>
                        <name>TIME_STAMP</name>
                        <description>Free-Running Counter Time stamp. This 16-bit field is a copy of the Free-Running Timer, captured for Tx and Rx frames at the time when the beginning of the Identifier field appears on the CAN bus</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                     <field>
                        <name>DLC</name>
                        <description>Length of the data to be stored/transmitted</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>RTR</name>
                        <description>Remote Transmission Request. One/zero for remote/data frame</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>IDE</name>
                        <description>ID Extended. One/zero for extended/standard format frame</description>
                        <bitOffset>21</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SRR</name>
                        <description>Substitute Remote Request. Contains a fixed recessive bit</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CODE</name>
                        <description>Reserved</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>ESI</name>
                        <description>Substitute Remote Request. Contains a fixed recessive bit</description>
                        <bitOffset>29</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BRS</name>
                        <description>Substitute Remote Request. Contains a fixed recessive bit</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EDL</name>
                        <description>Substitute Remote Request. Contains a fixed recessive bit</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>ID</name>
                  <description>Message Buffer 0 ID Register</description>
                  <addressOffset>0x4</addressOffset>
                  <fields>
                     <field>
                        <name>EXT</name>
                        <description>Contains extended (LOW word) identifier of message buffer</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>18</bitWidth>
                     </field>
                     <field>
                        <name>STD</name>
                        <description>Contains standard/extended (HIGH word) identifier of message buffer</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>11</bitWidth>
                     </field>
                     <field>
                        <name>PRIO</name>
                        <description>Local priority. This 3-bit fieldis only used when LPRIO_EN bit is set in MCR and it only makes sense for Tx buffers. These bits are not transmitted. They are appended to the regular ID to define the transmission priority</description>
                        <bitOffset>29</bitOffset>
                        <bitWidth>3</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>WORD0</name>
                  <description>Message Buffer 0 WORD0 Register</description>
                  <addressOffset>0x8</addressOffset>
                  <fields>
                     <field>
                        <name>DATA_BYTE_3</name>
                        <description>Data byte 3 of Rx/Tx frame</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>DATA_BYTE_2</name>
                        <description>Data byte 2 of Rx/Tx frame</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>DATA_BYTE_1</name>
                        <description>Data byte 1 of Rx/Tx frame</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>DATA_BYTE_0</name>
                        <description>Data byte 0 of Rx/Tx frame</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>WORD1</name>
                  <description>Message Buffer 0 WORD1 Register</description>
                  <addressOffset>0xC</addressOffset>
                  <fields>
                     <field>
                        <name>DATA_BYTE_7</name>
                        <description>Data byte 7 of Rx/Tx frame</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>DATA_BYTE_6</name>
                        <description>Data byte 6 of Rx/Tx frame</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>DATA_BYTE_5</name>
                        <description>Data byte 5 of Rx/Tx frame</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>DATA_BYTE_4</name>
                        <description>Data byte 4 of Rx/Tx frame</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
            <register>
               <dim>$(MESSAGE_BUFFER_COUNT)</dim>
               <dimIncrement>4</dimIncrement>
               <name>RXIMR%s</name>
               <description>Rx Individual Mask</description>
               <addressOffset>0x880</addressOffset>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>MI</name>
                     <description>Individual Mask Bits</description>
                     <bitOffset>0</bitOffset>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>The corresponding bit in the filter is &quot;don&apos;t care.&quot;</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>The corresponding bit in the filter is checked</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
